BryanBiver/Embedded_II_Setup/stm32l4s5_gpio.h
typedef struct 
{
    uint32_t pin0: 1;
    uint32_t pin1: 1;
    uint32_t pin2: 1;
    uint32_t pin3: 1;
    uint32_t pin4: 1;
    uint32_t pin5: 1;
    uint32_t pin6: 1;
    uint32_t pin7: 1;
    uint32_t pin8: 1;
    uint32_t pin9: 1;
    uint32_t pin10: 1;
    uint32_t pin11: 1;
    uint32_t pin12: 1;
    uint32_t pin13: 1;
    uint32_t pin14: 1;
    uint32_t pin15: 1;
    uint32_t pin16: 1;
    uint32_t pin17: 1;
    uint32_t pin18: 1;
    uint32_t pin19: 1;
    uint32_t pin20: 1;
    uint32_t pin21: 1;
    uint32_t pin22: 1;
    uint32_t pin23: 1;
    uint32_t pin24: 1;
    uint32_t pin25: 1;
    uint32_t pin26: 1;
    uint32_t pin27: 1;
    uint32_t pin28: 1;
    uint32_t pin29: 1;
    uint32_t pin30: 1;
    uint32_t pin31: 1;
} GPIOx_x_TypeDef;

/*
typedef struct {
	uint32_t pin0: 1;
	uint32_t pin1: 1;
	uint32_t pin2: 1;
	uint32_t pin3: 1;
	uint32_t pin4: 1;
	uint32_t pin5: 1;
	uint32_t pin6: 1;
	uint32_t pin7: 1;
	uint32_t pin8: 1;
	uint32_t pin9: 1;
	uint32_t pin10: 1;
	uint32_t pin11: 1;
	uint32_t pin12: 1;
	uint32_t pin13: 1;
	uint32_t pin14: 1;
	uint32_t pin15: 1;
	uint32_t RESERVED1: 16;
} GPIOx_16_TypeDef;

typedef struct {
	uint32_t pin0: 1;
	uint32_t pin1: 1;
	uint32_t pin2: 1;
	uint32_t pin3: 1;
	uint32_t pin4: 1;
	uint32_t pin5: 1;
	uint32_t pin6: 1;
	uint32_t pin7: 1;
	uint32_t pin8: 1;
	uint32_t pin9: 1;
	uint32_t pin10: 1;
	uint32_t pin11: 1;
	uint32_t pin12: 1;
	uint32_t pin13: 1;
	uint32_t pin14: 1;
	uint32_t pin15: 1;
    uint32_t pin16: 1;
	uint32_t RESERVED1: 15;
} GPIOx_17_TypeDef;

typedef struct {
	uint32_t pin0: 2;
	uint32_t pin1: 2;
	uint32_t pin2: 2;
	uint32_t pin3: 2;
	uint32_t pin4: 2;
	uint32_t pin5: 2;
	uint32_t pin6: 2;
	uint32_t pin7: 2;
	uint32_t pin8: 2;
	uint32_t pin9: 2;
	uint32_t pin10: 2;
	uint32_t pin11: 2;
	uint32_t pin12: 2;
	uint32_t pin13: 2;
	uint32_t pin14: 2;
	uint32_t pin15: 2;
} GPIOx_2_TypeDef;

*/